[
    {
        "names": "Keith, P. & Calden, A.",
        "date": "(2014, April)",
        "title": "Multinational Comparison of Self-Efficacy as a Predictor for Middle School Mathematics",
        "type": "Poster presented at 2014 Symposium for Research and Innovation in Educaiton",
        "location": "Amherst, MA"
    },
    {
        "names": "Keith. P.",
        "date": "(2014, July)", 
        "title": "Self-Efficacy Beliefs of College Algebra Students with Learning Disabilities", 
        "type": "Poster presented at 2014 Psychology of Mathematics Education (PME) conference",
        "location": "Vancouver, BC, Canada"
    },
    {
        "names": "Sullivan, F. & Keith, P.",
        "date": "(2015, April)", 
        "title": "Microgenetic Learning Analytics: A Computational Approach to Research on Student Learning", 
        "type": "Poster presented at the Center for Data Science Launch Symposium",
        "location": "Amherst, MA"
    },
    {
        "names": "Sullivan, F. & Keith, P.",
        "date": "(2015, April)", 
        "title": "Microgenetic Learning Analytics: A Computational Approach to Research on Student Learning", 
        "type": " Paper presented at 2015 American Educational Research Association (AERA) annual meeting",
        "location": "Chicago, IL"
    },
    {
        "names": "Sullivan, F. & Keith, P.",
        "date": "(2015, June)", 
        "title": "Examining Power Relations in an All-Girl Robotics Learning Environment", 
        "type": " Data session presented at the 11th International Conference on Computer Supported Learning (CSCL)",
        "location": "Gothenburg, Sweden"
    },
    {
        "names": "Fall, R., Keith, P., Sullivan, F. & Sullivan, K.",
        "date": "(2016 January)", 
        "title": "Girls Connect: Investigating Girls' Collaborative Learning Activities in a Robotics Setting", 
        "type": "Paper presented at the 2016 Technology in Education Conference and Expo",
        "location": "Holyoke, MA"
    },
    {
        "names": "Sullivan, F., Keith, P. & Poza, R.",
        "date": "(2016, April)", 
        "title": "Internalized Stereotypes: Do They Play a Role in Girls’ Robotics Learning.", 
        "type": "Poster presented at the 2016 American Educational Research Association (AERA) annual meeting",
        "location": "Washington, DC"
    },
    {
        "names": "Sullivan, F., Keith, P., & Wilson, N",
        "date": "(2016, April)", 
        "title": "Learning From the Periphery in a Collaborative Robotics Workshop for Girls", 
        "type": "Paper presented at the 2016 American Educational Research Association (AERA) annual meeting",
        "location": "Washington, DC"
    },
    {
        "names": "Keith, P.",
        "date": "(2016, June)", 
        "title": "Using Manipulatives to Teach Mathematics Concepts", 
        "type": "Presentation at the 2016 Landmark College Summer Institute",
        "location": "Putney, VT"
    },
    {
        "names": "Keith, P., Sullivan, F.",
        "date": "(2017, June)", 
        "title": "Using Sequential Analysis to Characterize the Relationship Between Roles, Collaboration, and Computational Thinking", 
        "type": "Paper presented at the 2017 Jean Piaget Society annual meeting",
        "location": "San Francisco, CA"
    },
    {
        "names": "Sullivan, F., Keith, P., Poza, R.",
        "date": "(2017, June)", 
        "title": "Girls, Robotics Learning, and Internalized Stereotypes:  Is There a Relationship?", 
        "type": "Poster presented at the 2017 Computer Supported Collaborative Learning (CSCL) conference",
        "location": "Philadelphia, PA"
    },
    {
        "names": "Keith, P., Sullivan, F.",
        "date": "(2017, July)", 
        "title": "Emergent Roles, Collaboration, and Computational Thinking in the Multi-Dimensional Problem Space of Robotics", 
        "type": "Paper presented at the 2017 International Conference on Computational Thinking Education",
        "location": "Hong Kong"
    },
    {
        "names": "Meng, Y., Rumshisky, A., Sullivan, F., Keith, P.",
        "date": "(2018, April)", 
        "title": "Exploring the Relationship of Emergent Roles, Collaboration, and Computational Thinking in Educational Robotics", 
        "type": "Poster presented at the 2018 American Educational Research Association (AERA) annual meeting",
        "location": "New York, NY"
    },
    {
        "names": "Keith, P., Sullivan, F.",
        "date": "(2018, April)", 
        "title": "Exploring the Relationship of Emergent Roles, Collaboration, and Computational Thinking in Educational Robotics", 
        "type": "Poster presented at the 2018 American Educational Research Association (AERA) annual meeting",
        "location": "New York, NY"
    },
    {
        "names": "Sullivan, F., Keith, P.",
        "date": "(2018, April)", 
        "title": "Computational Thinking and Doing With Robotics in an All-Girl Workshop Setting", 
        "type": "Paper presented at the 2018 American Educational Research Association (AERA) annual meeting",
        "location": "New York, NY"
    },
    {
        "names": "Sullivan, F., Keith, P., Soken, A., Pham, D",
        "date": " (2018, June)", 
        "title": "Learning to Think Computationally:  Comparative Outcomes of a Robotics Workshop for Girls", 
        "type": "Poster presented at the 13th International Conference of the Learning Sciences",
        "location": "London, UK"
    }
]